{"format": "layers-model", "generatedBy": "keras v2.0.9", "convertedBy": "TensorFlow.js Converter v1.2.2.1", "modelTopology": {"keras_version": "2.0.9", "backend": "tensorflow", "model_config": {"config": [{"config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["conv_pw_13_relu", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "name": "input_1", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"padding": "same", "name": "conv1", "strides": [2, 2], "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "filters": 32, "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": false, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv1_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "conv1_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv1_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "name": "conv1_relu"}, {"config": {"padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv_dw_1", "strides": [1, 1], "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "depth_multiplier": 1, "use_bias": false, "activation": "linear", "depthwise_regularizer": null, "dilation_rate": [1, 1], "depthwise_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "name": "conv_dw_1"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_dw_1_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "name": "conv_dw_1_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_dw_1_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "name": "conv_dw_1_relu"}, {"config": {"padding": "same", "name": "conv_pw_1", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "filters": 64, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": false, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "name": "conv_pw_1"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_pw_1_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "name": "conv_pw_1_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_pw_1_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "name": "conv_pw_1_relu"}, {"config": {"padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv_dw_2", "strides": [2, 2], "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "depth_multiplier": 1, "use_bias": false, "activation": "linear", "depthwise_regularizer": null, "dilation_rate": [1, 1], "depthwise_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "name": "conv_dw_2"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_dw_2_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "name": "conv_dw_2_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_dw_2_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "name": "conv_dw_2_relu"}, {"config": {"padding": "same", "name": "conv_pw_2", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "filters": 128, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": false, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "name": "conv_pw_2"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_pw_2_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "name": "conv_pw_2_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_pw_2_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "name": "conv_pw_2_relu"}, {"config": {"padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv_dw_3", "strides": [1, 1], "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "depth_multiplier": 1, "use_bias": false, "activation": "linear", "depthwise_regularizer": null, "dilation_rate": [1, 1], "depthwise_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "name": "conv_dw_3"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_dw_3_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "name": "conv_dw_3_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_dw_3_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "name": "conv_dw_3_relu"}, {"config": {"padding": "same", "name": "conv_pw_3", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "filters": 128, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": false, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "name": "conv_pw_3"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_pw_3_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "name": "conv_pw_3_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_pw_3_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "name": "conv_pw_3_relu"}, {"config": {"padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv_dw_4", "strides": [2, 2], "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "depth_multiplier": 1, "use_bias": false, "activation": "linear", "depthwise_regularizer": null, "dilation_rate": [1, 1], "depthwise_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "name": "conv_dw_4"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_dw_4_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "name": "conv_dw_4_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_dw_4_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "name": "conv_dw_4_relu"}, {"config": {"padding": "same", "name": "conv_pw_4", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "filters": 256, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": false, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "name": "conv_pw_4"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_pw_4_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "name": "conv_pw_4_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_pw_4_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "name": "conv_pw_4_relu"}, {"config": {"padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv_dw_5", "strides": [1, 1], "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "depth_multiplier": 1, "use_bias": false, "activation": "linear", "depthwise_regularizer": null, "dilation_rate": [1, 1], "depthwise_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "name": "conv_dw_5"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_dw_5_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "name": "conv_dw_5_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_dw_5_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "name": "conv_dw_5_relu"}, {"config": {"padding": "same", "name": "conv_pw_5", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "filters": 256, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": false, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "name": "conv_pw_5"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_pw_5_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "name": "conv_pw_5_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_pw_5_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "name": "conv_pw_5_relu"}, {"config": {"padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv_dw_6", "strides": [2, 2], "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "depth_multiplier": 1, "use_bias": false, "activation": "linear", "depthwise_regularizer": null, "dilation_rate": [1, 1], "depthwise_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "name": "conv_dw_6"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_dw_6_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "name": "conv_dw_6_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_dw_6_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "name": "conv_dw_6_relu"}, {"config": {"padding": "same", "name": "conv_pw_6", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "filters": 512, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": false, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "name": "conv_pw_6"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_pw_6_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "name": "conv_pw_6_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_pw_6_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "name": "conv_pw_6_relu"}, {"config": {"padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv_dw_7", "strides": [1, 1], "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "depth_multiplier": 1, "use_bias": false, "activation": "linear", "depthwise_regularizer": null, "dilation_rate": [1, 1], "depthwise_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "name": "conv_dw_7"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_dw_7_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "name": "conv_dw_7_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_dw_7_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "name": "conv_dw_7_relu"}, {"config": {"padding": "same", "name": "conv_pw_7", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "filters": 512, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": false, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "name": "conv_pw_7"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_pw_7_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "name": "conv_pw_7_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_pw_7_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "name": "conv_pw_7_relu"}, {"config": {"padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv_dw_8", "strides": [1, 1], "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "depth_multiplier": 1, "use_bias": false, "activation": "linear", "depthwise_regularizer": null, "dilation_rate": [1, 1], "depthwise_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "name": "conv_dw_8"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_dw_8_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "name": "conv_dw_8_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_dw_8_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "name": "conv_dw_8_relu"}, {"config": {"padding": "same", "name": "conv_pw_8", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "filters": 512, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": false, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "name": "conv_pw_8"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_pw_8_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "name": "conv_pw_8_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_pw_8_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "name": "conv_pw_8_relu"}, {"config": {"padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv_dw_9", "strides": [1, 1], "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "depth_multiplier": 1, "use_bias": false, "activation": "linear", "depthwise_regularizer": null, "dilation_rate": [1, 1], "depthwise_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "name": "conv_dw_9"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_dw_9_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "name": "conv_dw_9_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_dw_9_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "name": "conv_dw_9_relu"}, {"config": {"padding": "same", "name": "conv_pw_9", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "filters": 512, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": false, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "name": "conv_pw_9"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_pw_9_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "name": "conv_pw_9_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_pw_9_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "name": "conv_pw_9_relu"}, {"config": {"padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv_dw_10", "strides": [1, 1], "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "depth_multiplier": 1, "use_bias": false, "activation": "linear", "depthwise_regularizer": null, "dilation_rate": [1, 1], "depthwise_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "name": "conv_dw_10"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_dw_10_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "name": "conv_dw_10_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_dw_10_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "name": "conv_dw_10_relu"}, {"config": {"padding": "same", "name": "conv_pw_10", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "filters": 512, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": false, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "name": "conv_pw_10"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_pw_10_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "name": "conv_pw_10_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_pw_10_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "name": "conv_pw_10_relu"}, {"config": {"padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv_dw_11", "strides": [1, 1], "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "depth_multiplier": 1, "use_bias": false, "activation": "linear", "depthwise_regularizer": null, "dilation_rate": [1, 1], "depthwise_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "name": "conv_dw_11"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_dw_11_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "name": "conv_dw_11_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_dw_11_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "name": "conv_dw_11_relu"}, {"config": {"padding": "same", "name": "conv_pw_11", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "filters": 512, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": false, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "name": "conv_pw_11"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_pw_11_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "name": "conv_pw_11_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_pw_11_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "name": "conv_pw_11_relu"}, {"config": {"padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv_dw_12", "strides": [2, 2], "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "depth_multiplier": 1, "use_bias": false, "activation": "linear", "depthwise_regularizer": null, "dilation_rate": [1, 1], "depthwise_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "name": "conv_dw_12"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_dw_12_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "name": "conv_dw_12_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_dw_12_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "name": "conv_dw_12_relu"}, {"config": {"padding": "same", "name": "conv_pw_12", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "filters": 1024, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": false, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "name": "conv_pw_12"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_pw_12_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "name": "conv_pw_12_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_pw_12_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "name": "conv_pw_12_relu"}, {"config": {"padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv_dw_13", "strides": [1, 1], "trainable": true, "bias_constraint": null, "data_format": "channels_last", "kernel_size": [3, 3], "depth_multiplier": 1, "use_bias": false, "activation": "linear", "depthwise_regularizer": null, "dilation_rate": [1, 1], "depthwise_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "name": "conv_dw_13"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_dw_13_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "name": "conv_dw_13_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_dw_13_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "name": "conv_dw_13_relu"}, {"config": {"padding": "same", "name": "conv_pw_13", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "filters": 1024, "kernel_size": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": false, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "name": "conv_pw_13"}, {"config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.99, "beta_regularizer": null, "scale": true, "name": "conv_pw_13_bn", "gamma_constraint": null, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "name": "conv_pw_13_bn"}, {"config": {"trainable": true, "activation": "relu6", "name": "conv_pw_13_relu"}, "class_name": "Activation", "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "name": "conv_pw_13_relu"}], "name": "mobilenet_1.00_224"}, "class_name": "Model"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "global_average_pooling2d_1"}, "class_name": "GlobalAveragePooling2D"}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.5, "name": "dropout_1", "seed": null}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "bias_constraint": null, "trainable": true, "units": 3, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "softmax", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}, "training_config": {"loss_weights": null, "optimizer_config": {"config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "decay": 0.0, "beta_2": 0.9990000128746033, "epsilon": 1e-08}, "class_name": "Adam"}, "loss": "binary_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "dense_1/kernel", "shape": [1024, 3], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [3], "dtype": "float32"}, {"name": "conv1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv1_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "conv_dw_1_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "conv_pw_1/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "conv_pw_1_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_1_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "conv_dw_2_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_2/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "conv_pw_2_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_2_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_dw_3_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_3/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "conv_pw_3_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_3_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_dw_4_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_4/kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "conv_pw_4_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_4_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "conv_dw_5_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_5/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "conv_pw_5_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_5_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "conv_dw_6_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_6/kernel", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "conv_pw_6_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_6_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_7_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_7/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_7_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_7_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_8_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_8/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_8_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_8_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_9_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_9/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_9_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_9_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_10_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_10/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_10_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_10_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_11_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_11/kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_pw_11_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_11_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_dw_12_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_12/kernel", "shape": [1, 1, 512, 1024], "dtype": "float32"}, {"name": "conv_pw_12_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_12_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13/depthwise_kernel", "shape": [3, 3, 1024, 1], "dtype": "float32"}, {"name": "conv_dw_13_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_13/kernel", "shape": [1, 1, 1024, 1024], "dtype": "float32"}, {"name": "conv_pw_13_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_13_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv1_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv1_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv_pw_1_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_1_bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_2_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_2_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_3_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_3_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_4_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_4_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_5_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_5_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_6_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_6_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_7_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_7_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_8_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_8_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_9_bn/moving_mean", "shape": [512], "dtype": "float32"}, 